// 定义了一个变量，内容是使用地图的工具获取的矢量地图的区域点的坐标
var roi = pie.Geometry.Polygon([
    [
        [
            100.20751821719415,
            25.60745862687031
        ],
        [
            100.29082054369258,
            25.60745862687031
        ],
        [
            100.29082054369258,
            25.575142344610185
        ],
        [
            100.20751821719415,
            25.575142344610185
        ],
        [
            100.20751821719415,
            25.60745862687031
        ]
    ]
], null);

print(roi); // 控制台输出变量的相关信息 

/**
 * 将roi获取的区域框选出来，并填充的颜色为透明(000000000),框体颜色为FF0000，框体粗细为1
 * 图层名称为“大理”
 */
Map.addLayer(roi, { color: "FF0000", fillColor: "00000000", width: 1 }, "大理"); 
